# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'speedtest-cli' #needed for alfred workflow speedtest
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
#brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
#brew 'imagemagick'
#brew 'libmemcached'
#brew 'meilisearch'
#brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'hadolint' #Dockerfile formatter

# Apps
cask 'bitwarden'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'github'
cask 'vivaldi'
cask 'google-drive'
cask 'imageoptim'
cask 'pastebot'
cask 'phpmon'
cask 'flux'
cask 'selfcontrol'
cask 'jumpshare'
cask 'visual-studio-code'
cask 'tableplus'
cask 'the-unarchiver'
cask 'notion'
cask 'logseq'
cask 'vlc'
cask 'clean-me' #https://github.com/Kevin-De-Koninck/Clean-Me
cask 'appcleaner' #uninstaller
cask 'android-file-transfer' #transfer file from android to macOS
cask 'koodo-reader' #mobi pdf reader

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store

mas 'GIPHY Capture. The GIF Maker', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Sketchpad Premium', id: 1562886727
